// Задача 21
// Напишите программу, которая 
// принимает на вход координаты двух точек и 
// находит расстояние между ними в 3D пространстве.
// A (3,6,8); B (2,1,-7), -> 15.84
// A (7,-5, 0); B (1,-1,9) -> 11.53

Console.WriteLine("Введите координаты 2-х точек в 3D пространстве");
Console.WriteLine("для определения расстояния между ними");
int Array();
int count = 0;
while (true)
{
    
}
while (count > 3)
{
Console.WriteLine("Введите три координаты точки А :");
}
